In [3]:
import numpy as np 
import pandas as pd 
import requests
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
filelocation = "E:\Rnw\python\data processing and feature enginering\customer_dataset_150k.csv"
df = pd.read_csv(filelocation)
df.head()

<>:1: SyntaxWarning: invalid escape sequence '\R'
<>:1: SyntaxWarning: invalid escape sequence '\R'
C:\Users\parth\AppData\Local\Temp\ipykernel_10644\3658218482.py:1: SyntaxWarning: invalid escape sequence '\R'
  filelocation = "E:\Rnw\python\data processing and feature enginering\customer_dataset_150k.csv"

   Customer_ID  Age   Income  Purchases  Gender Churn
0            1   56  1950128         19    Male   Yes
1            2   69  1736643         11  Female   Yes
2            3   46   359252         14    Male    No
3            4   32  1992955         23    Male    No
4            5   60  1519496         16    Male    No

In [5]:
filelocation1 = "E:\Rnw\python\data processing and feature enginering\StudentPerformance.json"
df1 = pd.read_json(filelocation1)
df1 = pd.json_normalize(df1['Sheet1'])
df1.head()

<>:1: SyntaxWarning: invalid escape sequence '\R'
<>:1: SyntaxWarning: invalid escape sequence '\R'
C:\Users\parth\AppData\Local\Temp\ipykernel_10644\3639707011.py:1: SyntaxWarning: invalid escape sequence '\R'
  filelocation1 = "E:\Rnw\python\data processing and feature enginering\StudentPerformance.json"

,Hours Studied,Previous Scores,Extracurricular Activities,Sleep Hours,Sample Question Papers Practiced,Performance Index
0,7,99,Yes,9,1,91
1,4,82,No,4,2,65
2,8,51,Yes,7,2,45
3,5,52,Yes,5,2,36
4,7,75,No,8,5,66

In [ ]:
conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="0000",
    database="collage_db"
)

query = "SELECT * FROM students"
df = pd.read_sql(query, conn)

df.head()

In [8]:
url = "https://jsonplaceholder.typicode.com/users"
response = requests.get(url)

In [9]:
response.status_code

200

In [10]:
data = response.json()
df3 = pd.DataFrame(data)

df3.head()

,id,name,username,email,address,phone,website,company
0,1,Leanne Graham,Bret,Sincere@april.biz,"{'street': 'Kulas Light', 'suite': 'Apt. 556',...",1-770-736-8031 x56442,hildegard.org,"{'name': 'Romaguera-Crona', 'catchPhrase': 'Mu..."
1,2,Ervin Howell,Antonette,Shanna@melissa.tv,"{'street': 'Victor Plains', 'suite': 'Suite 87...",010-692-6593 x09125,anastasia.net,"{'name': 'Deckow-Crist', 'catchPhrase': 'Proac..."
2,3,Clementine Bauch,Samantha,Nathan@yesenia.net,"{'street': 'Douglas Extension', 'suite': 'Suit...",1-463-123-4447,ramiro.info,"{'name': 'Romaguera-Jacobson', 'catchPhrase': ..."
3,4,Patricia Lebsack,Karianne,Julianne.OConner@kory.org,"{'street': 'Hoeger Mall', 'suite': 'Apt. 692',...",493-170-9623 x156,kale.biz,"{'name': 'Robel-Corkery', 'catchPhrase': 'Mult..."
4,5,Chelsey Dietrich,Kamren,Lucio_Hettinger@annie.ca,"{'street': 'Skiles Walks', 'suite': 'Suite 351...",(254)954-1289,demarco.info,"{'name': 'Keebler LLC', 'catchPhrase': 'User-c..."

In [11]:
df.head()

   Customer_ID  Age   Income  Purchases  Gender Churn
0            1   56  1950128         19    Male   Yes
1            2   69  1736643         11  Female   Yes
2            3   46   359252         14    Male    No
3            4   32  1992955         23    Male    No
4            5   60  1519496         16    Male    No

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150000 entries, 0 to 149999
Data columns (total 6 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Customer_ID  150000 non-null  int64
 1   Age          150000 non-null  int64
 2   Income       150000 non-null  int64
 3   Purchases    150000 non-null  int64
 4   Gender       150000 non-null  object
 5   Churn        150000 non-null  object
dtypes: int64(4), object(2)
memory usage: 6.9+ MB

In [13]:
df.describe()

         Customer_ID            Age        Income      Purchases
count  150000.000000  150000.000000  1.500000e+05  150000.000000
mean    75000.500000      43.518613  1.100955e+06      15.001927
std     43301.414527      14.978371  5.199816e+05       3.874294
min         1.000000      18.000000  2.000080e+05       1.000000
25%     37500.750000      31.000000  6.507988e+05      12.000000
50%     75000.500000      44.000000  1.101249e+06      15.000000
75%    112500.250000      56.000000  1.550308e+06      18.000000
max    150000.000000      69.000000  1.999991e+06      34.000000

In [14]:
df.describe(include='object')

        Gender   Churn
count   150000  150000
unique       2       2
top       Male      No
freq     75356  112826

In [15]:
(df.isnull().sum() / len(df)) * 100

Customer_ID    0.0
Age            0.0
Income         0.0
Purchases      0.0
Gender         0.0
Churn          0.0
dtype: float64

In [16]:
df.duplicated().sum()

np.int64(0)

In [17]:
df[df.duplicated()]

Empty DataFrame
Columns: [Customer_ID, Age, Income, Purchases, Gender, Churn]
Index: []

In [18]:
df.duplicated().sum()

np.int64(0)

In [19]:
plt.figure()
sns.histplot(df['Age'], kde=True)
plt.title("Distribution of Age")
plt.show()

plt.figure()
sns.histplot(df['Income'], kde=True)
plt.title("Distribution of Income")
plt.show()

plt.figure()
sns.histplot(df['Purchases'], kde=True)
plt.title("Distribution of Purchases")
plt.show()

C:\Users\parth\AppData\Local\Temp\ipykernel_10644\2984711900.py:4: UserWarning: FigureCanvasAgg is non-interactive, and thus cannot be shown
  plt.show()
C:\Users\parth\AppData\Local\Temp\ipykernel_10644\2984711900.py:9: UserWarning: FigureCanvasAgg is non-interactive, and thus cannot be shown
  plt.show()
C:\Users\parth\AppData\Local\Temp\ipykernel_10644\2984711900.py:14: UserWarning: FigureCanvasAgg is non-interactive, and thus cannot be shown
  plt.show()

In [20]:
plt.figure()
sns.boxplot(x='Gender', y='Purchases', data=df)
plt.title("Gender vs Purchases")
plt.show()

C:\Users\parth\AppData\Local\Temp\ipykernel_10644\2683248219.py:4: UserWarning: FigureCanvasAgg is non-interactive, and thus cannot be shown
  plt.show()

In [21]:
plt.figure()
sns.boxplot(x='Churn', y='Income', data=df)
plt.title("Income vs Churn")
plt.show()

C:\Users\parth\AppData\Local\Temp\ipykernel_10644\2390089395.py:4: UserWarning: FigureCanvasAgg is non-interactive, and thus cannot be shown
  plt.show()

In [22]:
plt.figure(figsize=(8,6))
corr = df[['Age', 'Income', 'Purchases']].corr()
sns.heatmap(corr, annot=True, cmap='coolwarm')
plt.title("Correlation Heatmap")
plt.show()

C:\Users\parth\AppData\Local\Temp\ipykernel_10644\1424031502.py:5: UserWarning: FigureCanvasAgg is non-interactive, and thus cannot be shown
  plt.show()

In [23]:
sns.pairplot(
    df[['Age', 'Income', 'Purchases', 'Churn']],
    hue='Churn'
)
plt.show()

C:\Users\parth\AppData\Local\Temp\ipykernel_10644\701795133.py:5: UserWarning: FigureCanvasAgg is non-interactive, and thus cannot be shown
  plt.show()

In [24]:
import pandas as pd
from ydata_profiling import ProfileReport

# Load dataset
df = pd.read_csv("customer_dataset_150k.csv")

# Generate profiling report
profile = ProfileReport(
    df,
    title="Customer Dataset Profiling Report",
    explorative=True
)

# Save report as HTML
profile.to_file("customer_profiling_report.html")

100%|██████████| 6/6 [00:00<00:00, 16.68it/s]00<00:01,  5.31it/s, Describe variable: Churn]
Summarize dataset: 100%|██████████| 31/31 [00:56<00:00,  1.84s/it, Completed]
Generate report structure: 100%|██████████| 1/1 [00:01<00:00,  1.15s/it]
Render HTML: 100%|██████████| 1/1 [00:06<00:00,  6.41s/it]
Export report to file: 100%|██████████| 1/1 [00:00<00:00,  2.93it/s]

In [25]:
https://drive.google.com/file/d/1pKVkTJRykMTuMGoFrpKUwSv3jL09Sau8/view?usp=sharing

SyntaxError: invalid decimal literal (2096088890.py, line 1)